zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph2/PERI_FLASH_NMPA.h
#define FLASH_NMPA_GPO0_0_FRO_TRIM_VALID_MASK    (0x1U)
#define FLASH_NMPA_GPO0_0_FRO_TRIM_VALID_SHIFT   (0U)
#define FLASH_NMPA_GPO0_0_FRO_TRIM_VALID(x)      (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_0_FRO_TRIM_VALID_SHIFT)) & FLASH_NMPA_GPO0_0_FRO_TRIM_VALID_MASK)

#define FLASH_NMPA_GPO0_0_FRO32K_NTAT_MASK       (0xEU)
#define FLASH_NMPA_GPO0_0_FRO32K_NTAT_SHIFT      (1U)
#define FLASH_NMPA_GPO0_0_FRO32K_NTAT(x)         (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_0_FRO32K_NTAT_SHIFT)) & FLASH_NMPA_GPO0_0_FRO32K_NTAT_MASK)

#define FLASH_NMPA_GPO0_0_FRO32K_PTAT_MASK       (0x70U)
#define FLASH_NMPA_GPO0_0_FRO32K_PTAT_SHIFT      (4U)
#define FLASH_NMPA_GPO0_0_FRO32K_PTAT(x)         (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_0_FRO32K_PTAT_SHIFT)) & FLASH_NMPA_GPO0_0_FRO32K_PTAT_MASK)

#define FLASH_NMPA_GPO0_0_FRO32K_CAPCAL_MASK     (0xFF80U)
#define FLASH_NMPA_GPO0_0_FRO32K_CAPCAL_SHIFT    (7U)
#define FLASH_NMPA_GPO0_0_FRO32K_CAPCAL(x)       (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_0_FRO32K_CAPCAL_SHIFT)) & FLASH_NMPA_GPO0_0_FRO32K_CAPCAL_MASK)

#define FLASH_NMPA_GPO0_0_FIELD_MASK             (0xFFFF0000U)
#define FLASH_NMPA_GPO0_0_FIELD_SHIFT            (16U)
#define FLASH_NMPA_GPO0_0_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_0_FIELD_SHIFT)) & FLASH_NMPA_GPO0_0_FIELD_MASK)
/*! @} */

/*! @name GPO0_1 - GPO0 register 1 description */
/*! @{ */

#define FLASH_NMPA_GPO0_1_FIELD_MASK             (0xFFFFFFFFU)
#define FLASH_NMPA_GPO0_1_FIELD_SHIFT            (0U)
#define FLASH_NMPA_GPO0_1_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_1_FIELD_SHIFT)) & FLASH_NMPA_GPO0_1_FIELD_MASK)
/*! @} */

/*! @name GPO0_2 - GPO0 register 2 description */
/*! @{ */

#define FLASH_NMPA_GPO0_2_SYSTEM_SPEED_CODE_MASK (0x3U)
#define FLASH_NMPA_GPO0_2_SYSTEM_SPEED_CODE_SHIFT (0U)
/*! SYSTEM_SPEED_CODE - 00 : FRO12MHz 01 : FRO24MHz 10 : FRO48MHz 11 : FRO96MHz */
#define FLASH_NMPA_GPO0_2_SYSTEM_SPEED_CODE(x)   (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_2_SYSTEM_SPEED_CODE_SHIFT)) & FLASH_NMPA_GPO0_2_SYSTEM_SPEED_CODE_MASK)

#define FLASH_NMPA_GPO0_2_FLASH_CTRL_OPMODE_MASK (0xCU)
#define FLASH_NMPA_GPO0_2_FLASH_CTRL_OPMODE_SHIFT (2U)
/*! FLASH_CTRL_OPMODE - 00 : Delay Line 01 : RCLK (back up clock) 10 : PCLK (back up clock) */
#define FLASH_NMPA_GPO0_2_FLASH_CTRL_OPMODE(x)   (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_2_FLASH_CTRL_OPMODE_SHIFT)) & FLASH_NMPA_GPO0_2_FLASH_CTRL_OPMODE_MASK)

#define FLASH_NMPA_GPO0_2_FIELD_MASK             (0xFFFFFFF0U)
#define FLASH_NMPA_GPO0_2_FIELD_SHIFT            (4U)
#define FLASH_NMPA_GPO0_2_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_2_FIELD_SHIFT)) & FLASH_NMPA_GPO0_2_FIELD_MASK)
/*! @} */

/*! @name GPO0_3 - GPO0 register 3 description */
/*! @{ */

#define FLASH_NMPA_GPO0_3_FIELD_MASK             (0xFFFFFFFFU)
#define FLASH_NMPA_GPO0_3_FIELD_SHIFT            (0U)
#define FLASH_NMPA_GPO0_3_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_3_FIELD_SHIFT)) & FLASH_NMPA_GPO0_3_FIELD_MASK)
/*! @} */

/*! @name GPO0_ARRAY - GPO0 array description */
/*! @{ */

#define FLASH_NMPA_GPO0_ARRAY_FIELD_MASK         (0xFFFFFFFFU)
#define FLASH_NMPA_GPO0_ARRAY_FIELD_SHIFT        (0U)
#define FLASH_NMPA_GPO0_ARRAY_FIELD(x)           (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO0_ARRAY_FIELD_SHIFT)) & FLASH_NMPA_GPO0_ARRAY_FIELD_MASK)
/*! @} */

/* The count of FLASH_NMPA_GPO0_ARRAY */
#define FLASH_NMPA_GPO0_ARRAY_COUNT              (4U)

/*! @name GPO1_0 - GPO1 register 0 description */
/*! @{ */

#define FLASH_NMPA_GPO1_0_FINAL_TEST_NOT_DONE_MASK (0xFU)
#define FLASH_NMPA_GPO1_0_FINAL_TEST_NOT_DONE_SHIFT (0U)
/*! FINAL_TEST_NOT_DONE - FINAL_TEST_NOT_DONE[3:0]: 1010 : Final Test Not Done. All Other values: Final Test Done. */
#define FLASH_NMPA_GPO1_0_FINAL_TEST_NOT_DONE(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_0_FINAL_TEST_NOT_DONE_SHIFT)) & FLASH_NMPA_GPO1_0_FINAL_TEST_NOT_DONE_MASK)

#define FLASH_NMPA_GPO1_0_PARTCONFIG_MASK        (0x7F0U)
#define FLASH_NMPA_GPO1_0_PARTCONFIG_SHIFT       (4U)
/*! PARTCONFIG - Device type number. (E.g : LPC5569 stored as 69 decimal) */
#define FLASH_NMPA_GPO1_0_PARTCONFIG(x)          (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_0_PARTCONFIG_SHIFT)) & FLASH_NMPA_GPO1_0_PARTCONFIG_MASK)

#define FLASH_NMPA_GPO1_0_DEVICE_TYPE_SEC_MASK   (0x800U)
#define FLASH_NMPA_GPO1_0_DEVICE_TYPE_SEC_SHIFT  (11U)
/*! DEVICE_TYPE_SEC - Security device type: 0: LPC55xxx (Non Secure Familly) 1: LPC55Sxxx (Secure Familly) */
#define FLASH_NMPA_GPO1_0_DEVICE_TYPE_SEC(x)     (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_0_DEVICE_TYPE_SEC_SHIFT)) & FLASH_NMPA_GPO1_0_DEVICE_TYPE_SEC_MASK)

#define FLASH_NMPA_GPO1_0_SRAM_SIZE_MASK         (0xF000U)
#define FLASH_NMPA_GPO1_0_SRAM_SIZE_SHIFT        (12U)
/*! SRAM_SIZE - SRAM_SIZE[3:0]: (For Niobe4) 0000 : 320 KB 0001 : 256 KB 0010 : 144 KB 0011 : 80 KB
 *    (For Niobe4 Mini) 0100 : 96 KB 0101 : 80 KB 0110 : 64 KB 0111 : 48 KB All others : RESERVED
 */
#define FLASH_NMPA_GPO1_0_SRAM_SIZE(x)           (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_0_SRAM_SIZE_SHIFT)) & FLASH_NMPA_GPO1_0_SRAM_SIZE_MASK)

#define FLASH_NMPA_GPO1_0_CPU0_SECURITY_EXTENSION_DISABLE_MASK (0xF0000U)
#define FLASH_NMPA_GPO1_0_CPU0_SECURITY_EXTENSION_DISABLE_SHIFT (16U)
/*! CPU0_SECURITY_EXTENSION_DISABLE - CPU0_SECURITY_EXTENSION_DISABLE[3:0]: 1010 : CPU0 Security
 *    Extension is disabled. All Other values: CPU0 Security Extension is enabled.
 */
#define FLASH_NMPA_GPO1_0_CPU0_SECURITY_EXTENSION_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_0_CPU0_SECURITY_EXTENSION_DISABLE_SHIFT)) & FLASH_NMPA_GPO1_0_CPU0_SECURITY_EXTENSION_DISABLE_MASK)

#define FLASH_NMPA_GPO1_0_FIELD_MASK             (0xF00000U)
#define FLASH_NMPA_GPO1_0_FIELD_SHIFT            (20U)
#define FLASH_NMPA_GPO1_0_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_0_FIELD_SHIFT)) & FLASH_NMPA_GPO1_0_FIELD_MASK)

#define FLASH_NMPA_GPO1_0_ROM_REVISION_MINOR_MASK (0xF000000U)
#define FLASH_NMPA_GPO1_0_ROM_REVISION_MINOR_SHIFT (24U)
/*! ROM_REVISION_MINOR - ROM Revision-Minor [3:0] */
#define FLASH_NMPA_GPO1_0_ROM_REVISION_MINOR(x)  (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_0_ROM_REVISION_MINOR_SHIFT)) & FLASH_NMPA_GPO1_0_ROM_REVISION_MINOR_MASK)

#define FLASH_NMPA_GPO1_0_METAL_REVISION_ID_MASK (0xF0000000U)
#define FLASH_NMPA_GPO1_0_METAL_REVISION_ID_SHIFT (28U)
/*! METAL_REVISION_ID - METAL REVISION ID[3:0] */
#define FLASH_NMPA_GPO1_0_METAL_REVISION_ID(x)   (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_0_METAL_REVISION_ID_SHIFT)) & FLASH_NMPA_GPO1_0_METAL_REVISION_ID_MASK)
/*! @} */

/*! @name GPO1_1 - GPO1 register 1 description */
/*! @{ */

#define FLASH_NMPA_GPO1_1_ROM_PATCH_VERSION_MASK (0xFU)
#define FLASH_NMPA_GPO1_1_ROM_PATCH_VERSION_SHIFT (0U)
/*! ROM_PATCH_VERSION - ROM Patch Version [3:0] */
#define FLASH_NMPA_GPO1_1_ROM_PATCH_VERSION(x)   (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_1_ROM_PATCH_VERSION_SHIFT)) & FLASH_NMPA_GPO1_1_ROM_PATCH_VERSION_MASK)

#define FLASH_NMPA_GPO1_1_CUSTOMER_REVISION_ID_MASK (0xF0U)
#define FLASH_NMPA_GPO1_1_CUSTOMER_REVISION_ID_SHIFT (4U)
/*! CUSTOMER_REVISION_ID - CUSTOMER REVISION ID[3:0] */
#define FLASH_NMPA_GPO1_1_CUSTOMER_REVISION_ID(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_1_CUSTOMER_REVISION_ID_SHIFT)) & FLASH_NMPA_GPO1_1_CUSTOMER_REVISION_ID_MASK)

#define FLASH_NMPA_GPO1_1_FIELD_MASK             (0xFFFFFF00U)
#define FLASH_NMPA_GPO1_1_FIELD_SHIFT            (8U)
#define FLASH_NMPA_GPO1_1_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_1_FIELD_SHIFT)) & FLASH_NMPA_GPO1_1_FIELD_MASK)
/*! @} */

/*! @name GPO1_2 - GPO1 register 2 description */
/*! @{ */

